<a href="https://colab.research.google.com/github/laurendunbar/ds1002-npr9wk/blob/main/homework/week-13.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework - Week 13

Complete the following blocks as specified in the directions. Run each cell to return the desired output. Save your notebook back to your GitHub repository and submit the GitHub URL to your notebook for review.

## 1. Change Runtime to R (1 pt)

Change the runtime of this notebook to R. You can verify that you are running R by displaying the current version you are running. Run the cell below and show the output.

In [1]:
version

               _
platform       x86_64-pc-linux-gnu
arch           x86_64
os             linux-gnu
system         x86_64, linux-gnu
status
major          4
minor          3.2
year           2023
month          10
day            31
svn rev        85441
language       R
version.string R version 4.3.2 (2023-10-31)
nickname       Eye Holes

## 2. Create Vectors (2 pts)

Create two vectors in the cells below, according to the prompts given.

In [2]:
# create a vector with 7 integer values. Assign it to a variable named "my_integers"
my_integers <- c(1, 2, 3, 4, 5, 6, 7)
print(my_integers)

[1] 1 2 3 4 5 6 7

In [5]:
var1 = 8
var2 = 4
var3 = 12
var4 = 25

# Using the variables given above, assign three new variables the following calculated values:
#
# 1. Your first variable should be assigned the calculated value of var2 divided by var1.
# 2. Your second variable should be assigned the calculated value of var2 cubed times var3.
# 3. Your third variable should be assigned the calculated value of var4 integer divided by var3.
#
# Next, create an array populated by your three variables. Assign the array to a new variable named "my_calculated_values"

calc_var1 <- var2 / var1
calc_var2 <- var2^3 * var3
calc_var3 <- var4 %/% var3

my_calculated_values <- c(calc_var1, calc_var2, calc_var3)

cat("Calculated Value 1:", calc_var1, "\n")
cat("Calculated Value 2:", calc_var2, "\n")
cat("Calculated Value 3:", calc_var3, "\n")
cat("Array of Calculated Values:", my_calculated_values, "\n")

Calculated Value 1: 0.5
Calculated Value 2: 768
Calculated Value 3: 2
Array of Calculated Values: 0.5 768 2

## 3. Vector Indexes (3 pts)

In the cell below, create a vector that starts with the integer 4, that increments by counts of 3 all the way to 28.

Assign the vector to a variable name.

In [7]:
my_vector <- seq(from = 4, to = 28, by = 3)
print(my_vector)

[1]  4  7 10 13 16 19 22 25 28

Next, show how to display this vector with the 3 index removed.

In [9]:
my_vector_without_index_3 <- my_vector[-3]

print(my_vector_without_index_3)

[1]  4  7 13 16 19 22 25 28

Finally, show how to delete the 4th, 5th, and 7th indexes from the vector and update the vector so they are forever removed from the vector.

Hint: there is a fairly simple way to do this in one line, such that you don't have to run a separate command for each removal.

In [10]:
indices_to_remove <- c(4, 5, 7)

my_vector_updated <- my_vector[-indices_to_remove]

print(my_vector_updated)

[1]  4  7 10 19 25 28

## 4. Create a Data Frame (3 pts)

In the cell below create a data frame with 10 observations (rows) and 5 variables (columns) each. This data frame will describe some of your favorite musical performers. You can use real or fictitious data to populate your data frame.

Variables:
  - `artist` - Artist or band name
  - `category` - Rock, Pop, Country, Hip-hop, Jazz, Classical, Soul, Other. (Try to distribute your selections here)
  - `size` - (number of members, 1-?)
  - `start` - Debut year of artist.
  - `grammy` - Grammmy winner? `TRUE` | `FALSE`

First create vectors for each variable populated with your own performer data. Then create a data frame from these vectors (be sure to assign column names too) and assign it to a named variable such as `df`.

In [12]:
artist <- c("The Beatles", "Beyoncé", "Johnny Cash", "Kendrick Lamar", "Miles Davis",
            "Ludwig van Beethoven", "Aretha Franklin", "Daft Punk", "Taylor Swift", "Queen")

category <- c("Rock", "Pop", "Country", "Hip-hop", "Jazz", "Classical", "Soul", "Other", "Pop", "Rock")

size <- c(4, 1, 1, 1, NA, NA, 1, 2, 1, 4)

start <- c(1960, 1998, 1954, 2011, 1945, 1770, 1956, 1993, 2005, 1970)

grammy <- c(TRUE, TRUE, FALSE, TRUE, TRUE, FALSE, TRUE, TRUE, TRUE, TRUE)

df <- data.frame(artist = artist, category = category, size = size, start = start, grammy = grammy)

print(df)

                 artist  category size start grammy
1           The Beatles      Rock    4  1960   TRUE
2               Beyoncé       Pop    1  1998   TRUE
3           Johnny Cash   Country    1  1954  FALSE
4        Kendrick Lamar   Hip-hop    1  2011   TRUE
5           Miles Davis      Jazz   NA  1945   TRUE
6  Ludwig van Beethoven Classical   NA  1770  FALSE
7       Aretha Franklin      Soul    1  1956   TRUE
8             Daft Punk     Other    2  1993   TRUE
9          Taylor Swift       Pop    1  2005   TRUE
10                Queen      Rock    4  1970   TRUE

## 5. Filter/Query a Data Frame (2 pts)

Use the data frame you created above and show how to perform the following queries.

In [13]:
# Display the first 3 records and only the `artist`, `category` and `grammy` columns for each.
df[1:3, c("artist", "category", "grammy")]

  artist      category grammy
1 The Beatles Rock      TRUE
2 Beyoncé     Pop       TRUE
3 Johnny Cash Country  FALSE

In [17]:
# Display the records for just one musical category, such as only Rock bands or only Hip-hop bands.
rock_bands <- df[df$category == "Rock", ]
print(rock_bands)

        artist category size start grammy
1  The Beatles     Rock    4  1960   TRUE
10       Queen     Rock    4  1970   TRUE

## Query a Data Frame using `tidyverse` (4 pts)

1. Show how to load the library.
2. Show how to glimpse basic features of the `starwars` data table.
3. Create a query using tidyverse that retrieves the following data:
    - Selects only these columns: `name`, `height`, `sex`, `species`.
    - Filters for all species that are NOT Human.
    - Arranges the resulting data in order by name.

Show your output in a data frame.

In [25]:
library(tidyverse)
data(starwars)
glimpse(starwars)

query_starwars <- starwars %>%
  select(name, height, sex, species) %>%
  filter(species != "Human") %>%
  arrange(name)

query_starwars

Rows: 87
Columns: 14
$ name       <chr> "Luke Skywalker", "C-3PO", "R2-D2", "Darth Vader", "Leia Or…
$ height     <int> 172, 167, 96, 202, 150, 178, 165, 97, 183, 182, 188, 180, 2…
$ mass       <dbl> 77.0, 75.0, 32.0, 136.0, 49.0, 120.0, 75.0, 32.0, 84.0, 77.…
$ hair_color <chr> "blond", NA, NA, "none", "brown", "brown, grey", "brown", N…
$ skin_color <chr> "fair", "gold", "white, blue", "white", "light", "light", "…
$ eye_color  <chr> "blue", "yellow", "red", "yellow", "brown", "blue", "blue",…
$ birth_year <dbl> 19.0, 112.0, 33.0, 41.9, 19.0, 52.0, 47.0, NA, 24.0, 57.0, …
$ sex        <chr> "male", "none", "none", "male", "female", "male", "female",…
$ gender     <chr> "masculine", "masculine", "masculine", "masculine", "femini…
$ homeworld  <chr> "Tatooine", "Tatooine", "Naboo", "Tatooine", "Alderaan", "T…
$ species    <chr> "Human", "Droid", "Droid", "Human", "Human", "Human", "Huma…
$ films      <list> <"The Empire Strikes Back", "Revenge of the Sith", "Return…
$ vehicles   <list> <"Snowspeeder", "Imperial Speeder Bike">, <>, <>, <>, "Imp…
$ starships  <list> <"X-wing", "Imperial shuttle">, <>, <>, "TIE Advanced x1",…

   name                  height sex            species
1  Ackbar                180    male           Mon Calamari
2  Adi Gallia            184    female         Tholothian
3  Ayla Secura           178    female         Twi'lek
4  BB8                    NA    none           Droid
5  Barriss Offee         166    female         Mirialan
6  Ben Quadinaros        163    male           Toong
7  Bib Fortuna           180    male           Twi'lek
8  Bossk                 190    male           Trandoshan
9  C-3PO                 167    none           Droid
10 Chewbacca             228    male           Wookiee
11 Darth Maul            175    male           Zabrak
12 Dexter Jettster       198    male           Besalisk
13 Dud Bolt               94    male           Vulptereen
14 Eeth Koth             171    male           Zabrak
15 Gasgano               122    male           Xexto
16 Greedo                173    male           Rodian
17 Grievous              216    male           Kaleesh
18 IG-88                 200    none           Droid
19 Jabba Desilijic Tiure 175    hermaphroditic Hutt
20 Jar Jar Binks         196    male           Gungan
21 Ki-Adi-Mundi          198    male           Cerean
22 Kit Fisto             196    male           Nautolan
23 Lama Su               229    male           Kaminoan
24 Luminara Unduli       170    female         Mirialan
25 Mas Amedda            196    male           Chagrian
26 Nien Nunb             160    male           Sullustan
27 Nute Gunray           191    male           Neimodian
28 Plo Koon              188    male           Kel Dor
29 Poggle the Lesser     183    male           Geonosian
30 R2-D2                  96    none           Droid
31 R4-P17                 96    none           Droid
32 R5-D4                  97    none           Droid
33 Ratts Tyerell          79    male           Aleena
34 Roos Tarpals          224    male           Gungan
35 Rugor Nass            206    male           Gungan
36 Saesee Tiin           188    male           Iktotchi
37 San Hill              191    male           Muun
38 Sebulba               112    male           Dug
39 Shaak Ti              178    female         Togruta
40 Tarfful               234    male           Wookiee
41 Taun We               213    female         Kaminoan
42 Tion Medon            206    male           Pau'an
43 Wat Tambor            193    male           Skakoan
44 Watto                 137    male           Toydarian
45 Wicket Systri Warrick  88    male           Ewok
46 Yarael Poof           264    male           Quermian
47 Yoda                   66    male           Yoda's species
48 Zam Wesell            168    female         Clawdite